# 인접 행렬

V, E = map(int, input().split())  # Vertex, Edge 개수
# V가 1로 시작하면 0 ~ 8, 8 * 8 인접 행렬을 만들어 주어야 함

adj_matrix = [[0] * (V + 1) for _ in range(V + 1)]  # 1부터 시작하니까 0은 안 쓰고 / 1 ~ V + 1

for _ in range(E):  # 간선 갯수만큼 돌면서 연결 정보를 받음
    start, end = map(int, input().split())
    adj_matrix[start][end] = 1
    adj_matrix[end][start] = 1  # 양방향 그래프니까

# 결과
# [[0, 0, 0, 0, 0, 0, 0, 0],
#  [0, 0, 1, 1, 0, 0, 0, 0],
#  [0, 1, 0, 0, 1, 1, 0, 0],
#  [0, 1, 0, 0, 0, 0, 0, 1],
#  [0, 0, 1, 0, 0, 0, 1, 0],
#  [0, 0, 1, 0, 0, 0, 1, 0],
#  [0, 0, 0, 0, 1, 1, 0, 1],
#  [0, 0, 0, 1, 0, 0, 1, 0]]
